Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Example 2. ereg_replace() Example
pt_br: Exemplo 2. ereg_replace() Example

source: Table 1. error_log() log types
pt_br: Tabela 1. error_log() log types

source: Example 1. error_log() examples
pt_br: Exemplo 1. error_log() examples

source: Example 1. error_reporting() examples
pt_br: Exemplo 1. error_reporting() examples

source: Table 1. error_reporting() level constants and bit values
pt_br: Tabela 1. error_reporting() level constants and bit values

source: eval() evaluates the string given in code_str as PHP code.
pt_br: Descrição

source: There are some factors to keep in mind when using eval().
pt_br: A função eval() executa a string dada no parâmetro code_str A função eval() executa a string dada no parâmetro code_str como código PHP.

source: Remember that the string passed must be valid PHP code, including things like terminating statements with a semicolon so the parser doesn' t die on the line after the eval(), and properly escaping things in code_str.
pt_br: Há alguns fatores para lembrar quando usar eval().

source: A return statement will terminate the evaluation of the string immediately.
pt_br: Lembre-se que a string passada deve ser código PHP valido, incluindo coisas como terminar os comandos com ponto-e-vírgula assim o compilador não morre uma linha após eval(), escapar as coisas propriamente em code_str.

source: In PHP 4, eval() returns NULL unless return() is called in the evaluated code, in which case the value passed to return() In PHP 4, eval() returns NULL unless return() is called in the evaluated code, in which case the value passed to return() is returned.
pt_br: Um comando return irá terminar a execução do script imediatamente No PHP 4, eval() retorna NULL a menos que return() seja chamado no código executado, caso no qual o valor passado para return() é retornado.

source: In PHP 3, eval() does not return a value.
pt_br: No PHP 3, eval() não retorna um valor.

source: Example 1. eval() example - simple text merge
pt_br: Exemplo eval()

source: ?php $string = 'cup'; $name = 'coffee'; $str = 'This is a $string with my $name in it. br'; echo $str; eval ("\$str = \"$str\" ;"); echo $str;?
pt_br: ?php $string = 'taça'; $name = 'café'; $str = 'Esta é uma $string com o meu $name nela. br'; echo $str; eval ("\$str = \"$str\" ;"); echo $str;?

source: The above example will show:
pt_br: O exemplo acima irá mostrar

source: This is a $string with my $name in it.
pt_br: Esta é uma $string com o meu $name nela.

source: This is a cup with my coffee in it.
pt_br: Esta é uma taça com o meu café nela.

source: Example 1. exif_read_data() example
pt_br: Exemplo 1. exif_read_data() example

source: Example 1. exif_thumbnail() example
pt_br: Exemplo 1. exif_thumbnail() example

source: This is not a real function, but a language construct.
pt_br: Esta não é uma função real, mas uma construção da linguagem.

source: The exit() function terminates execution of the script.
pt_br: A função exit() termina a execução do script.

source: It prints status just before exiting.
pt_br: Ela mostra o parâmetro status justamente antes de sair.

source: If status is an integer, that value will also be used as the exit status.
pt_br: Se status é um integer, este valor será usado como estado se saída.

source: Exit statuses should be in the range 1 to 254, the exit status 255 is reserved by PHP and shall not be used.
pt_br: Estados de saída deve, estar no intervalo de 1 a 254, o estado de saída 255 é reservado pelo php e não deve ser usado.

source: The current CVS version does NOT print the status if it is an integer.
pt_br: A versão atual do CVS NÃO mostra status se for um integer.

source: The die() function is an alias for exit().
pt_br: A função die() é um apelido para a função exit().

source: Example 1. exit() example
pt_br: Exemplo exit()

source: ?php $filename = '/ path / to / data-file'; $file = fopen ($filename, 'r') or exit("unable to open file ($filename)");?
pt_br: ?php $filename = '/ caminho / para / arquivo'; $file = fopen ($filename, 'r') or exit("Não pude abrir o arquivo ($filename)");?

source: Returns e raised to the power of arg.
pt_br: Retorna e a potência de arg.

source: Returns an array of strings, each of which is a substring of string formed by splitting it on boundaries formed by the string separator.
pt_br: Retorna uma matriz de strings, cada uma como substring de string formada pela divisão dela a partir de fronteiras presentes nela separator.

source: If limit is set, the returned array will contain a maximum of limit elements with the last element containing the rest of string.
pt_br: Se limit está definido, a matriz retornada conterá o máximo de limit elementos com o último elemento contendo o resto da string.

source: If separator is an empty string (""), explode() will return FALSE.
pt_br: Se separator está como uma string vazia (""), explode() retornará FALSE.

source: If separator contains a value that is not contained in string, then explode() will return an array containing string.
pt_br: Se separator contém um valor que não está contido em string, então explode() retornará uma matriz contendo a string.

source: The limit parameter was added in PHP 4.0.1
pt_br: O parâmetro limit foi adicionado no PHP 4.0.1

source: Example 1. explode() examples
pt_br: Exemplo 1. explode() exemplos

source: Although implode() can for historical reasons accept its parameters in either order, explode() cannot.
pt_br: Ainda que implode() pode por razões históricas aceitar seus parâmetros em uma das duas ordens, explode() não pode.

source: You must ensure that the separator argument comes before the string argument.
pt_br: Você deve assegurar que o argumento separator vem antes do argumento string.

source: See also preg_split(), spliti(), split(), and implode().
pt_br: Veja também preg_split(), spliti(), split(), e implode().

source: This function is used to import variables from an array into the current symbol table.
pt_br: Essa função é usada para importar variáveis a partir de um array para a tabela de símbolos corrente.

source: It takes an associative array var_array and treats keys as variable names and values as variable values.
pt_br: Recebe o array associativo var_array e trata as suas chaves como os nomes das variáveis e os valores como valores das variáveis.

source: For each key / value pair it will create a variable in the current symbol table, subject to extract_type and prefix parameters.
pt_br: Para cada par chave / valor ele criará uma variável na tabela de símbolos corrente, seguindo os parâmetros extract_type e prefix.

source: Beginning with version 4.0.5, this function returns the number of variables extracted.
pt_br: Desde a versão 4.0.5, essa função retorna o número de variáveis extraídas.

source: EXTR_IF_EXISTS and EXTR_PREFIX_IF_EXISTS was introduced in version 4.2.0.
pt_br: EXTR_IF_EXISTS e EXTR_PREFIX_IF_EXISTS foram adicionadas na versão 4.2.0.

source: EXTR_REFS was introduced in version 4.3.0.
pt_br: EXTR_REFS foi adicionada na versão 4.3.0.

source: It also checks for collisions with existing variables in the symbol table.
pt_br: extract() checa se cada chave do array constitui um nome de variável válido e por colisões com as variáveis já existentes na tabela de símbolos.

source: The way invalid / numeric keys and collisions are treated is determined by the extract_type.
pt_br: O modo com que chaves inválidas ou númericas e colisões são tratadas é determinado pelo argumento extract_type.

source: It can be one of the following values:
pt_br: Esse argumento pode receber os seguintes valores:

source: If there is a collision, overwrite the existing variable.
pt_br: Se houver uma colisão, sobrescreve a variável existente.

source: If there is a collision, don 't overwrite the existing variable.
pt_br: Se houver uma colisão, não sobrescreve a variável existente.

source: If there is a collision, prefix the variable name with prefix.
pt_br: Se houver uma colisão, adiciona um prefixo ao nome da variável definido pelo argumento prefix.

source: Prefix all variable names with prefix.
pt_br: Adiciona um prefixo ao nome de todas as variáveis definido por prefix.

source: Beginning with PHP 4.0.5, this includes numeric variables as well.
pt_br: Desde o PHP 4.0.5 estão incluídos nomes numéricos.

source: Only prefix invalid / numeric variable names with prefix.
pt_br: Adiciona um prefixo definido por prefix apenas para variáveis como nomes inválidos ou numéricos.

source: This flag was added in PHP 4.0.5.
pt_br: Essa opção foi adicionada no PHP 4.0.5.

source: Only overwrite the variable if it already exists in the current symbol table, otherwise do nothing.
pt_br: Só sobrescreve a variável se ela já existe na tabela de símbolos corrente, caso contrário, não faz nada.

source: This is useful for defining a list of valid variables and then extracting only those variables you have defined out of $_REQUEST, for example.
pt_br: Isso é útil quando se quer definir uma lista de variáveis válidas e então extrair só as que foram definidas em $_REQUEST, por exemplo.

source: This flag was added in PHP 4.2.0.
pt_br: Essa opção foi adicionada no PHP 4.2.0.

source: Only create prefixed variable names if the non-prefixed version of the same variable exists in the current symbol table.
pt_br: Só cria nomes de variáveis usando o prefixo se na tabela de símbolos já existe uma variável com o nome sem esse prefixo.

source: This effectively means that the values of the imported variables are still referencing the values of the var_array parameter.
pt_br: Extrai variáveis como referências, ou seja, os valores das variáveis importadas ainda estarão referenciando os valores do parâmetro var_array.

source: You can use this flag on its own or combine it with any other flag by OR 'ing the extract_type.
pt_br: Essa opção pode ser usada sozinha ou em conjunto com as outras usando o operador 'ou' em extract_type.

source: This flag was added in PHP 4.3.0.
pt_br: Essa opação foi adicionada no PHP 4.3.0.

source: If extract_type is not specified, it is assumed to be EXTR_OVERWRITE.
pt_br: Se extract_type não for especificado, é assumido o valor EXTR_OVERWRITE por padrão.

source: Note that prefix is only required if extract_type is EXTR_PREFIX_SAME, EXTR_PREFIX_ALL, EXTR_PREFIX_INVALID or EXTR_PREFIX_IF_EXISTS.
pt_br: Note que prefix só é necessário se extract_type for EXTR_PREFIX_SAME, EXTR_PREFIX_ALL, ou EXTR_PREFIX_INVALID, EXTR_PREFIX_INVALID ou EXTR_IF_EXISTS.

source: If the prefixed result is not a valid variable name, it is not imported into the symbol table.
pt_br: Se o nome com o prefixo não for um nome de variável válido, ela não será importada para a tabela de símbolos.

source: extract() returns the number of variables successfully imported into the symbol table.
pt_br: extract() retorna o número de variáveis importadas com sucesso para a tabela de símbolos.

source: A possible use for extract() is to import into the symbol table variables contained in an associative array returned by wddx_deserialize().
pt_br: Uma possível utilização de extract() e na importação de variáveis contidas num array associativo retornado pela função wddx_deserialize().

source: Example 1. extract() example
pt_br: Exemplo de extract()

source: ?php / * Suppose that $var_array is an array returned from wddx_deserialize * / $size = "large"; $var_array = array ("color" = "blue", "size "= "medium", "shape" = "sphere"); extract ($var_array, EXTR_PREFIX_SAME, "wddx"); print "$color, $size, $shape, $wddx_size\n";?
pt_br: ?php / * Suponha que $var_array é um array retornado pela função wddx_deserialize * / $tamanho = "grande"; $var_array = array ("cor" = "azul", "tamanho "= "medio", "forma" = "esfera"); extract ($var_array, EXTR_PREFIX_SAME, "wddx"); print "$cor, $tamanho, $forma, $wddx_tamanho\n";?

source: The above example will produce:
pt_br: O exemplo acima produziria:

source: blue, large, sphere, medium
pt_br: azul, grande, esfera, medio

source: The $size wasn 't overwritten, because we specified EXTR_PREFIX_SAME, which resulted in $wddx_size being created.
pt_br: O $tamanho não foi sobrescrito, porque nós especificamos EXTR_PREFIX_SAME, o que resultou na criação da variável $wddx_tamanho.

source: If EXTR_SKIP was specified, then $wddx_size wouldn 't even have been created.
pt_br: Se EXTR_SKIP fosse utilizado, então $wddx_tamanho não seria criada.

source: EXTR_OVERWRITE would have caused $size to have value "medium", and EXTR_PREFIX_ALL would result in new variables being named $wddx_color, $wddx_size, and $wddx_shape.
pt_br: EXTR_OVERWRITE teria feito com que $tamanho tivesse o valor "medio", e EXTR_PREFIX_ALL resultaria em novas variáveis com os nomes $wddx_cor, $wddx_tamanho, e $wddx_forma.

source: You must use an associative array, a numerically indexed array will not produce results unless you use EXTR_PREFIX_ALL or EXTR_PREFIX_INVALID.
pt_br: Você deve usar um array associativo, um array indexado numericamente não produzirá resultados.

source: See also compact().
pt_br: Veja também compact().

source: ezmlm_hash() calculates the hash value needed when keeping EZMLM mailing lists in a MySQL database.
pt_br: ezmlm_hash() calcula valor do hash necessário quando mantendo listas de email EZMLM num banco de dados MySQL.

source: Calculating the hash and subscribing a user
pt_br: Calculando o hash e inscrevendo um usuário

source: Example 1. fbsql_close() example
pt_br: Exemplo 1. fbsql_close() example

source: fbsql_commit() ends the current transaction by writing all inserts, updates and deletes to the disk and unlocking all row and table locks held by the transaction.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Example 1. fbsql_connect() example
pt_br: Exemplo 1. fbsql_connect() example

source: Example 1. fbsql_create_blob() example
pt_br: Exemplo 1. fbsql_create_blob() example

source: Example 1. fbsql_create_clob() example
pt_br: Exemplo 1. fbsql_create_clob() example

source: Example 1. fbsql_create_db() example
pt_br: Exemplo 1. fbsql_create_db() example

source: fbsql_data_seek() moves the internal row pointer of the FrontBase result associated with the specified result identifier to point to the specified row number.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Example 1. fbsql_data_seek() example
pt_br: Exemplo 1. fbsql_data_seek() example

source: fbsql_drop_db() attempts to drop (remove) an entire database from the server associated with the specified link identifier.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Example 1. fbsql_fetch_array() example
pt_br: Exemplo 1. fbsql_fetch_array() example

source: Example 1. fbsql_fetch_assoc() example
pt_br: Exemplo 1. fbsql_fetch_assoc() example

source: Example 1. fbsql_fetch_field() example
pt_br: Exemplo 1. fbsql_fetch_field() example

source: Example 1. fbsql_fetch_object() example
pt_br: Exemplo 1. fbsql_fetch_object() example

source: Example 1. fbsql_field_name() example
pt_br: Exemplo 1. fbsql_field_name() example

source: Example 1. fbsql_field_type() example
pt_br: Exemplo 1. fbsql_field_type() example

source: Example 1. fbsql_list_dbs() example
pt_br: Exemplo 1. fbsql_list_dbs() example

source: Example 1. fbsql_list_fields() example
pt_br: Exemplo 1. fbsql_list_fields() example

source: Example 1. fbsql_next_result() example
pt_br: Exemplo 1. fbsql_next_result() example

source: fbsql_num_rows() returns the number of rows in a result set.
pt_br: Description

source: Example 1. fbsql_num_rows() example
pt_br: Exemplo 1. fbsql_num_rows() example

source: Example 1. fbsql_query() example
pt_br: Exemplo 1. fbsql_query() example

source: Example 2. fbsql_query() example
pt_br: Exemplo 2. fbsql_query() example

source: Example 1. fbsql_read_blob() example
pt_br: Exemplo 1. fbsql_read_blob() example

source: Example 1. fbsql_read_clob() example
pt_br: Exemplo 1. fbsql_read_clob() example

source: fbsql_rollback() ends the current transaction by rolling back all statements issued since last commit.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: fbsql_start_db()
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: fbsql_stop_db()
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Example 1. fbsql_tablename() example
pt_br: Exemplo 1. fbsql_tablename() example

source: The file pointed to by handle is closed.
pt_br: Descrição

source: Returns TRUE on success or FALSE on failure.
pt_br: O arquivo apontado por fp é fechado.

source: The file pointer must be valid, and must point to a file successfully opened by fopen() or fsockopen().
pt_br: O ponteiro para o arquivo tem que ser válido e tem que apontar para um arquivo aberto por fopen() ou fsockopen().

source: A simple fclose() example
pt_br: Exemplo fclose()

source: ?php $handle = fopen( 'somefile.txt', 'r'); fclose($handle);?
pt_br: ?php $fp = fopen( 'qualquerarquivo.txt', 'r'); fclose($fp);?

source: The fdf_create() creates a new FDF document.
pt_br: Description

source: The fdf_open() function opens a file with form data.
pt_br: Description

source: The fdf_save() function saves a FDF document.
pt_br: Description

source: The fdf_set_status() sets the value of the / STATUS key.
pt_br: Description

source: Returns TRUE if the file pointer is at EOF or an error occurs; otherwise returns FALSE.
pt_br: Retorna TRUE se o ponteiro estiver no fim do arquivo (eof) ou um erro ocorrer.

source: The file pointer must be valid, and must point to a file successfully opened by fopen(), popen(), or fsockopen().
pt_br: O ponteiro para o arquivo tem que ser válido e tem que apontar para um arquivo aberto com sucesso por fopen(), popen() ou fsockopen().

source: This function forces a write of all buffered output to the resource pointed to by the file handle handle.
pt_br: Esta função força a escrita de toda saída cacheada no buffer do arquivo apontado pelo recurso fp.

source: Returns TRUE if successful, FALSE otherwise.
pt_br: Retorna TRUE se obtiver sucesso e caso contrário FALSE.

source: Returns FALSE on EOF.
pt_br: Descrição

source: This function is binary safe.
pt_br: O ponteiro de arquivo tem que ser válido e apontar para um arquivo aberto com sucesso por fopen(), popen(), ou fsockopen().

source: See also fread(), fopen(), popen(), fsockopen(), and fgets().
pt_br: Veja também fread(), fopen(), popen(), fsockopen() e fgets().

source: Similar to fgets() except that fgetcsv() parses the line it reads for fields in CSV format and returns an array containing the fields read.
pt_br: Similar à fgets() exceto que fgetcsv() interpreta a linha que lê por campos no formato CSV e retorna um vetor (array) contendo os campos lidos.

source: The optional third delimiter parameter defaults as a comma.
pt_br: O terceiro parâmetro delimiter (opcional) tem como padrão a vígula.

source: The optional enclosure cannot be null, and is limited to one character.
pt_br: A opção enclosure não pode ser null, e está limitada a um caracter.

source: If enclosure is more than one character, only the first character is used.
pt_br: Se enclosure tiver mais que um carcater, somente o primeiro será utilizado.

source: The enclosure parameter was added in PHP 4.3.0.
pt_br: O parâmetro enclosure foi acrescentado no PHP 4.3.0.

source: The handle parameter must be a valid file pointer to a file successfully opened by fopen(), popen(), or fsockopen().
pt_br: O parâmetro fp tem que ser um ponteiro de arquivo válido para um arquivo aberto com sucesso por fopen(), popen() ou fsockopen().

source: The length parameter must be greater than the longest line to be found in the CSV file (allowing for trailing line-end characters).
pt_br: length tem que ser maior do que a maior linha a ser encontrada no arquivo CSV (incluindo caracteres de terminação de linha).

source: fgetcsv() returns FALSE on error, including end of file.
pt_br: fgetcsv() retorna FALSE ao encontrar um erro, incluindo fim de arquivo (eof).

source: A blank line in a CSV file will be returned as an array comprising a single null field, and will not be treated as an error.
pt_br: Uma linha em branco em um arquivo CSV será retornada como um array contendo um único campo nulo (null), e não será tratado como um erro.

source: Read and print the entire contents of a CSV file
pt_br: Lê e imprime todo o conteúdo de um arquivo CSV

source: ?php $row = 1; $handle = fopen ("test.csv" ,"r"); while ($data = fgetcsv ($handle, 1000, ",")) {$num = count ($data); print" p $num fields in line $row: br \n"; $row++; for ($c=0; $c $num; $c++) {print $data[$c]. "br \n";}} fclose ($handle);?
pt_br: ?php $row = 1; $fp = fopen ("test.csv" ,"r"); while ($data = fgetcsv ($fp, 1000, ",")) {$num = count ($data); print" p $num campos na linha $row: br "; $row++; for ($c=0; $c $num; $c++) {print $data[$c]." br ";}} fclose ($fp);?

source: See also explode(), file(), and pack()
pt_br: Veja também explode(), file() e pack()

source: Returns a string of up to length - 1 bytes read from the file pointed to by handle.
pt_br: Retorna uma string com até length - 1 bytes lidos do arquivo apontado por fp.

source: Reading ends when length - 1 bytes have been read, on a newline (which is included in the return value), or on EOF (whichever comes first).
pt_br: A leitura acaba quando length - 1 bytes foram lidos, encontra-se um fim de linha (newline) (que é incluido no valor retornado) ou no fim de arquivo (eof) (o que acontecer primeiro).

source: If no length is specified, the length defaults to 1k, or 1024 bytes.
pt_br: Se nenhum length for informado, o default é 1Kb, ou 1024 bytes.

source: If an error occurs, returns FALSE.
pt_br: Se um erro ocorrer, retorna FALSE.

source: Common Pitfalls:
pt_br: Equívocos comuns:

source: People used to the 'C' semantics of fgets() should note the difference in how EOF is returned.
pt_br: Pessoas acostumadas a semântica do fgets em 'C' devem notar a diferenca em como o fim do arquivo (EOF) é retornado.

source: A simple example follows:
pt_br: Um simples exemplo segue:

source: Reading a file line by line
pt_br: Lendo um arquivo linha a linha

source: $handle = fopen ("/ tmp / inputfile.txt", "r"); while (!feof ($handle)) {$buffer = fgets($handle, 4096); echo $buffer;} fclose ($handle);
pt_br: $fd = fopen ("/ tmp / arquivodeentrada.txt", "r"); while (!feof ($fd)) {$buffer = fgets($fd, 4096); echo $buffer;} fclose ($fd);

source: The length parameter became optional in PHP 4.2.0, if omitted, it would assume 1024 as the line length.
pt_br: O parâmetro length se tornou opcional a partir do PHP 4.2.0, e se omitido, tem default para 1024 bytes para o comprimento da linha.

source: As of PHP 4.3, omitting length will keep reading from the stream until it reaches the end of the line.
pt_br: A partir do PHP 4.3, omitindo length fará continuar a leitura a partir do stream até encontrar o fim da linha.

source: If the majority of the lines in the file are all larger than 8KB, it is more resource efficient for your script to specify the maximum line length.
pt_br: Se a maioria das linhas no arquivo forem todar maiores que 8 Kb, haverá mais eficiência de recursos se seus scripts informarem o comprimento máximo das linhas.

source: This function is binary safe as of PHP 4.3.
pt_br: Esta função é binary safe a partir do PHP 4.3.

source: Earlier versions were not binary safe.
pt_br: Versões anteriores não são seguras para dados binários.

source: If you are having problems with PHP not recognizing the line endings when reading files either on or created by a Macintosh computer, you might want to enable the auto_detect_line_endings run-time configuration option.
pt_br: Se você está tendo problemas com o PHP no reconhecimento do final de linha quando criando ou lendo arquivos num computador Macintosh, você pode habilitar a opção auto_detect_line_endings.
